<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"36b7504778bdb67774c23635f2e4c6182e50aa1d12c7c08a7f6b5f1b32b6bab5","plan_job_ref":"Job Write Terraform Plan to Pull Request #33 at https://github.com/hackforla/devops-security/actions/runs/8099020056","plan_out_hash":"fa44f87aca1f53dda7a454eb6c561cf49568630077e6beab2b52cfd65a6b07e7","plan_hash":"1b261cacaf3d04f26d3c19f57d74c86239785d34e4c0c90f5a93a12c5c189cc4","plan_text_format":"diff","version":"1.41.2"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # module.aws_custom_policies.aws_iam_policy.custom_policy["IAMServicesAdmin"] will be destroyed
  # (because key ["IAMServicesAdmin"] is not in for_each map)
-   resource "aws_iam_policy" "custom_policy" {
-       arn         = "arn:aws:iam::035866691871:policy/IAMServicesAdmin" -> null
-       description = "Policy granting IAM services admins permissions to make changes to user accounts" -> null
-       id          = "arn:aws:iam::035866691871:policy/IAMServicesAdmin" -> null
-       name        = "IAMServicesAdmin" -> null
-       path        = "/" -> null
-       policy      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "iam:CreateAccessKey",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:iam::*:user/*"
                    },
-                   {
-                       Action    = [
-                           "iam:UpdateLoginProfile",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "iam:ResourceTag/Access Level" = [
-                                   "1",
-                                   "2",
                                ]
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:iam::*:user/*"
                    },
-                   {
-                       Action   = [
-                           "cloudshell:CreateEnvironment",
-                           "cloudshell:GetEnvironmentStatus",
-                           "cloudshell:CreateSession",
-                           "cloudshell:StartEnvironment",
-                           "cloudshell:StopEnvironment",
                        ]
-                       Effect   = "Allow"
-                       Resource = "*"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       policy_id   = "ANPAQQWOSJEPRL2DTHOJL" -> null
-       tags        = {} -> null
-       tags_all    = {} -> null
    }

  # module.iam_services_admin_group.aws_iam_group.group will be destroyed
  # (because aws_iam_group.group is not in configuration)
-   resource "aws_iam_group" "group" {
-       arn       = "arn:aws:iam::035866691871:group/iam-services-admin-group" -> null
-       id        = "iam-services-admin-group" -> null
-       name      = "iam-services-admin-group" -> null
-       path      = "/" -> null
-       unique_id = "AGPAQQWOSJEPURLU5DTDL" -> null
    }

  # module.iam_services_supervisor_group.aws_iam_group.group will be created
+   resource "aws_iam_group" "group" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "iam-services-supervisor-group"
+       path      = "/"
+       unique_id = (known after apply)
    }

  # module.iam_services_supervisor_group.aws_iam_group_policy_attachment.group_policy_attachment["IAMServicesSupervisor"] will be created
+   resource "aws_iam_group_policy_attachment" "group_policy_attachment" {
+       group      = "iam-services-supervisor-group"
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::035866691871:policy/IAMServicesSupervisor"
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #33](https://github.com/hackforla/devops-security/actions/runs/8099020056)